// 함수는 어떤 동작을 수행하기 위한 코드를 모아놓은 것입니다. 따라서 함수의 이름은 대개 동사입니다.
// 함수 이름은 가능한 한 간결하고 명확해야 합니다.

//함수가 어떤 동작을 하는지 축약해서 설명해 주는 동사를 접두어로 붙여 함수 이름을 만드는 게 관습입니다.

//"show"로 시작하는 함수는 대개 무언가를 보여주는 함수입니다.

// 이 외에 아래와 같은 접두어를 사용할 수 있습니다.

// "get…" – 값을 반환함
// "calc…" – 무언가를 계산함
// "create…" – 무언가를 생성함
// "check…" – 무언가를 확인하고 불린값을 반환함

showMessage(); // 메시지를 보여줌
getAge(); // 나이를 나타내는 값을 얻고 그 값을 반환함
calcSum(); // 합계를 계산하고 그 결과를 반환함
createForm(); // form을 생성하고 만들어진 form을 반환함
checkPermission(); // 승인 여부를 확인하고 true나 false를 반환함
